app/controllers/images_controller.rb

  def create
    @image = Image.new(image_params)

    respond_to do |format|
      if @image.save
---
INSERT INTO "images" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "My Birthday"], ["description", "Today is my birthday !!!!!!!!!!!"], ["created_at", "2022-11-05 13:35:43.555406"], ["updated_at", "2022-11-05 13:35:43.555406"]]

  def update
    respond_to do |format|
      if @image.update(image_params)
---
UPDATE "images" SET "updated_at" = $1 WHERE "images"."id" = $2  [["updated_at", "2022-11-05 13:35:43.639962"], ["id", 1]]